---
kind: other
id: AllMembers.T:Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionZProfile
source: html/4de06966-b431-91e6-2430-92e9c8d9aeac.htm
---
# StructuralSectionZProfile Members

Creates a new instance of Structural Section Z Profile shape with the associated set of parameters,
 used to attach to structural element.